# 1.選擇性敘述的練習-season
# 輸入月份1~12月，判斷相對應的季節春、夏、秋、冬並印出。若不在此範圍則印出”輸入錯誤”。
# (備註︰春天是用 3、4和 5月，不是1、2和 3月)
#
# a = int(input('輸入月份1~12月:'))
# if 3 <= a <= 5:
#     print('春天')
# elif 6 <= a <= 8:
#     print('夏天')
# elif 9 <= a <= 11:
#     print('秋天')
# elif a == 12 or a == 1 or a == 2:
#     print('冬天')
# else:
#     print('輸入錯誤')

#-------------------------------------
# 2.選擇性敘述的練習-salary
# 輸入便利商店工讀生的工作時數，並計算其薪資。
# 60小時以內，時薪160元。
# 61~80小時，以時薪1.25倍計算。
# 81小時以上，以時薪1.5倍計算。
# 說明：薪資以累計方式計算。若工時為90小時，
# 則薪資為60*160 + 20*160*1.25 + 10*160*1.5元。
#
# h = float(input('工作時數:'))
# a = h * 160
# b = 9600 + ((h - 60) * 1.25 * 160)
# c = 9600 + 13600 + (h - 80) * 1.5* 160
# if h <= 60:
#     print(a, '元')
# elif 60 < h <= 80:
#     print(b, '元')
# elif h > 80:
#     print(c, '元')

# -----------------------------------------
# 3. 選擇性敘述的練習-electricity
# 輸入何種用電和度數，計算出需繳之電費。
# 電力公司使用累計方式來計算電費，分工業用電及家庭用電。
#                         家庭用電        工業用電
#    120度(含)以下          1.63元          0.5元
#    121~330(含)度         2.38元          0.5元
#    330度以上              3.52元         0.5元

# a = int(input("家庭用電=1,工業用電=2:"))
# b = float(input("用電度數:"))
# c = b * 1.63
# d = 195.6 + (b - 120) * 2.38
# e = 195.6 + 499.8 + (b - 330) * 3.52
# f = b * 0.5
# if a == 1:
#     if b <= 120:
#         print(c)
#     elif 120 < b <= 330:
#         print(d)
#     elif b > 330:
#         print(e)
# elif a == 2:
#     print(f)
#
# --------------------------------------
# 4.     選擇性敘述的練習-refund
# 輸入在某商店購物應付金額與實付金額。
# 實付金額小於應付金額，則印出”金額不足”。
# 實付金額等於應付金額，則印出”不必找錢”。
# 實付金額大於應付金額，則輸出找回金額最少的鈔票數和錢幣數。
# 假設幣值只有1000, 500, 100元紙鈔和50, 10, 5, 1元硬幣。
#
# 說明：若買了132元的商品，付1000元，應找回一張500元，三張100元，一個50元硬幣，一個10元硬幣，一個5元硬幣和三個1元硬幣。

# a = int(input("應付金額:"))
# b = int(input("實付金額:"))
#
# if a > b:
#     print("金額不足")
# elif a == b:
#     print("不必找錢")
# else:
#     c = b - a
#     for i in (1000, 500, 100, 50, 10, 5, 1):
#         print(f"找{c // i}張{i}元")
#         c = c - ((c // i) * i)
#
#  --------------------------------------
# 5.     迴圏的練習-password
# 出現”請輸入密碼”的提示，使用者有最多三次輸入的機會。
# 若輸入正確，則印出”密碼輸入正確，歡迎使用本系統！”。
# 若輸入不正確，再次出現”請輸入密碼”的提示。
# 若三次輸入不正確，則印出”密碼輸入超過三次！”，並結束程式的執行。
#
# x = 0
# password = "1234"
# while x < 3:
#     answer = input("請輸入密碼:")
#     if answer == password:
#         print("密碼輸入正確，歡迎使用本系統！")
#         break
#     elif answer != "1234":
#         x += 1
# else:
#     print("密碼輸入超過三次！")
